# Request a single column

In [14]:
import pandas as pd

live_and_visited = pd.DataFrame([
    ['안성', '성남', '서울'],
    ['여수', '순천', '전주'],
    ['부산', '울산', '울진'],
    ],
    columns = ['첫번째', '두번째', '세번째']
)

live_and_visited['세번째']

0    서울
1    전주
2    울진
Name: 세번째, dtype: object

In [20]:
live_and_visited[['첫번째', '세번째']]

  첫번째 세번째
0  안성  서울
1  여수  전주
2  부산  울진

# iloc returns specific rows and columns by position

In [22]:
live_and_visited.iloc[:, :]

  첫번째 두번째 세번째
0  안성  성남  서울
1  여수  순천  전주
2  부산  울산  울진

In [23]:
live_and_visited.iloc[0:2, :]

  첫번째 두번째 세번째
0  안성  성남  서울
1  여수  순천  전주

In [25]:
live_and_visited.iloc[:, 0:2]

  첫번째 두번째
0  안성  성남
1  여수  순천
2  부산  울산

In [26]:
live_and_visited.iloc[1, 1]

'순천'

In [28]:
live_and_visited.iloc[[0,2], [0,2]]
# live_and_visited.iloc[:, [0,2]]

  첫번째 세번째
0  안성  서울
1  여수  전주
2  부산  울진